# Requirements

For part 3 of the project you will be practicing applying an E.T.L process on your previously saved movie data. Specifically, you will create a new MySQL database after preparing the data for a relational database. You will export your database to a .sql file in your repository using MySQL Workbench.

* Specifications - Database

Your stakeholder wants you to take the data you have been cleaning and collecting in Parts 1 & 2 of the project, and wants you to create a MySQL database for them.

* You should normalize the tables as best you can before adding them to your new database.

    * Note: an important exception to their request is that they would like you to keep all of the data from the TMDB API in 1 table together (even though it will not be perfectly normalized).
You only need to keep the imdb_id, revenue, budget, and certification columns

* Required Transformation steps:

    * Normalize Genre:

        * Convert the single string of genres from title basics into 2 new tables.
    * title_genres: with the columns:

    1. tconst.
    2. genre_id
    3. genres:

        1. genre_id
        2. genre_name
        3. Discard unnecessary information:

* For the title basics table, drop the following columns:
    * "original_title" (we will use the primary title column instead)
    * "isAdult" ("Adult" will show up in the genres so this is redundant information).
    * "titleType" (every row will be a movie).
    * "genres" and other variants of genre (genre is now represented in the 2 new tables described above.
        * Do not include the title_akas table in your SQL database.
You have already filtered out the desired movies using this table and the remaining data is mostly nulls and not of-interest to the stakeholder.

* MySQL Database Requirements
Use sqlalchemy with pandas to execute your SQL queries inside your notebook.

    * Create a new database on your MySQL server and call it "movies".

    * Make sure to have the following tables in your "movies" database:

    1. title_basics
    2. title_ratings
    3. title_genres
    4. genres
    5. tmdb_data

        * Make sure to set a Primary Key for each table that isn't a joiner table (e.g. title_genres is a joiner table).

* After creating each table, show the first 5 rows of that table using a SQL query.

* Make sure to run the "SHOW TABLES" SQL query at the end of your notebook to show that all required tables have been created.

# Extraction

In [1]:
# Imports
import json
import pandas as pd
import numpy as np
import seaborn as sns
from scipy import stats

import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [2]:
# get basics and ratings info
basics = pd.read_csv('Data/title_basics.csv.gz')
ratings= pd.read_csv('Data/title.ratings.csv.gz')
 # load early 2000 movies file
early_2k_movies = pd.read_csv('Data/early_2k_movies.csv.gz')

# Explore

In [3]:
#explore basics
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,122,Drama
3,tt0079644,movie,November 1828,November 1828,0,2001,140,"Drama,War"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,100,"Comedy,Horror,Sci-Fi"

In [4]:
# explore ratings
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1913
1  tt0000002            5.8       258
2  tt0000003            6.5      1717
3  tt0000004            5.6       170
4  tt0000005            6.2      2533

In [5]:
# explore early 2000's
early_2k_movies.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certifcation
0,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.111,1985.0,PG
1,tt0118852,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}]",NaN,49511.0,en,Chinese Coffee,...,0.0,99.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,There's a fine line between friendship and bet...,Chinese Coffee,0.0,6.851,47.0,R
2,tt0119273,0.0,/f5C03doOWiauu37bToKXtpgP5bS.jpg,"{'id': 141086, 'name': 'Heavy Metal Collection...",15000000.0,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,16225.0,en,Heavy Metal 2000,...,0.0,88.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,not to survive the fight in the external world...,Heavy Metal 2000,0.0,6.134,160.0,R
3,tt0119495,0.0,NaN,NaN,0.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10749, '...",NaN,51181.0,en,Love 101,...,0.0,86.0,[],Released,NaN,Love 101,0.0,0.000,0.0,R
4,tt0120467,0.0,/knok3mNReKqPTplnnqz7E4dd7mD.jpg,NaN,120000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 27, 'name...",NaN,19085.0,en,Vulgar,...,14904.0,87.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Everyone loves a clown... some more than others.,Vulgar,0.0,5.400,42.0,R

# Transformations

## Normalize Early 2000's

In [6]:
# keep only id, revenue, budget, and certification from early 2000's
early_2k_movies = early_2k_movies[['imdb_id','revenue','budget','certifcation']]
early_2k_movies

       imdb_id     revenue      budget certifcation
0    tt0118694  12854953.0    150000.0           PG
1    tt0118852         0.0         0.0            R
2    tt0119273         0.0  15000000.0            R
3    tt0119495         0.0         0.0            R
4    tt0120467     14904.0    120000.0            R
..         ...         ...         ...          ...
815  tt0832449         0.0         0.0        PG-13
816  tt1073223         0.0         0.0        PG-13
817  tt2145114         0.0         0.0           NR
818  tt3041064         0.0         0.0           NR
819  tt8795764         0.0         0.0           NR

[820 rows x 4 columns]

In [7]:
# changing imdb_id to tconst as a consistent primary key for my columns
early_2k_movies = early_2k_movies.rename(columns = {'imdb_id':'tconst'})

In [8]:
# getting info for early 2000's
early_2k_movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 820 entries, 0 to 819
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   tconst        820 non-null    object
 1   revenue       820 non-null    float64
 2   budget        820 non-null    float64
 3   certifcation  820 non-null    object
dtypes: float64(2), object(2)
memory usage: 25.8+ KB

## Normalizing Genres

In [9]:
# create a col with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,122,Drama,[Drama]
3,tt0079644,movie,November 1828,November 1828,0,2001,140,"Drama,War","[Drama, War]"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
...,...,...,...,...,...,...,...,...,...
143286,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,51,Drama,[Drama]
143287,tt9916190,movie,Safeguard,Safeguard,0,2020,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
143288,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020,84,Thriller,[Thriller]
143289,tt9916362,movie,Coven,Akelarre,0,2020,92,"Drama,History","[Drama, History]"
143290,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019,123,Drama,[Drama]

In [10]:
# use .explode() to separate the list of genres into new rows:
# one row for each genre a movie belonged to.

exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...
143287,tt9916190,movie,Safeguard,Safeguard,0,2020,95,"Action,Adventure,Thriller",Thriller
143288,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020,84,Thriller,Thriller
143289,tt9916362,movie,Coven,Akelarre,0,2020,92,"Drama,History",Drama
143289,tt9916362,movie,Coven,Akelarre,0,2020,92,"Drama,History",History
143290,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019,123,Drama,Drama

In [11]:
# Convert string column to list
genres_split = basics['genres'].str.split(",")
# Explode and take unique entries only
unique_genres = genres_split.explode().unique()
unique_genres

array(['Comedy', 'Fantasy', 'Romance', 'Drama', 'War', 'Horror', 'Sci-Fi',
       'Mystery', 'Adventure', 'Musical', 'Action', 'Crime', 'Thriller',
       'Music', 'Animation', 'Family', 'History', 'Biography', 'Sport',
       'Western', 'Adult', 'Short', 'Reality-TV', 'News', 'Talk-Show',
       'Game-Show'], dtype=object)

In [12]:
# use .unique() to get the unique genres from the genres_split column

unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [13]:
# Create a new title_genres table
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [14]:
# Create a genre mapper dictionary to replace string genres with integers
## Making the genre mapper dictionary

genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [15]:
genre_id_map = dict(zip(unique_genres,range(len(unique_genres))))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [16]:
# make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns = 'genres_split')
title_genres

           tconst  genre_id
0       tt0035423         5
0       tt0035423         9
0       tt0035423        18
1       tt0062336         7
2       tt0069049         7
...           ...       ...
143287  tt9916190        23
143288  tt9916270        23
143289  tt9916362         7
143289  tt9916362        11
143290  tt9916538         7

[248497 rows x 2 columns]

In [17]:
# convert genre map into df
genre_lookup = pd.DataFrame({'genre_name': genre_id_map.keys(),
                            'genre_id': genre_id_map.values()})
genre_lookup.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [18]:
# Discard unnecessary information in Basics.
basics = basics.drop(columns=['originalTitle', 'isAdult','titleType', 'genres',
                             'genres_split'])
basics

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0079644,November 1828,2001,140
4,tt0088751,The Naked Monster,2005,100
...,...,...,...,...
143286,tt9916170,The Rehearsal,2019,51
143287,tt9916190,Safeguard,2020,95
143288,tt9916270,Il talento del calabrone,2020,84
143289,tt9916362,Coven,2020,92
143290,tt9916538,Kuambil Lagi Hatiku,2019,123

# SQL

## Creating Database

In [19]:
#load mysql credentials
with open('C:/Users/Sean/.edit/my_sql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['user', 'password'])

In [20]:
# create connection to database
from urllib.parse import quote_plus as urlquote
connection = f"mysql+pymysql://{login['user']}:{urlquote(login['password'])}@localhost/makin_better_movies.sql"
engine = create_engine(connection)

In [21]:
# check if db exists, if not create it
if database_exists(connection):
    print('Already Exists')
else:
    create_database(connection)
    print('Database Created')

Already Exists

## Saving MySQL Table With 'tconst' as the Primary Key

Since tconst is a string I'll need to perform the below steps

In [22]:
# get max string length
max_str_len = basics['tconst'].fillna('').map(len).max()
max_str_len

10

In [23]:
#Use 1 larger than the max_str/text_len `string(max_str_len +1 )`.

from sqlalchemy.types import *
# calculate max string length for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
certification_len = early_2k_movies['certifcation'].fillna('').map(len).max()

# create basics schema dictionry
basics_schema = {
    'tconst': String(key_len+1),
    'primaryTitle': Text(title_len+1),
    'startYear': Float(),
    'endYear': Float(),
    'runtimeMinutes': Integer()
}

# create ratings schema dictionry
ratings_schema = {
    'tconst': String(key_len+1),
    'averageRating': Float(),
    'genre_id': Integer()
}

# create early_2k schema dictionry
early_2k_schema = {
    'tconst': String(key_len+1),
    'budget': Float(),
    'revenue': Float(),
    'certifcation': String(certification_len+1)
}

# create title_genre schema dictionry
title_genres_schema ={
    'tconst': String(key_len+1),
    'genre_id': Integer()
}

In [24]:
# save db to df
basics.to_sql('basics', engine, dtype=basics_schema, index=False, if_exists = 'replace')
ratings.to_sql('ratings', engine, dtype=ratings_schema, index = False,if_exists = 'replace')
early_2k_movies.to_sql('early_2k_movies', engine, dtype=early_2k_schema, index= False, if_exists = 'replace')
title_genres.to_sql('title_genres', engine, dtype=title_genres_schema, index=False, if_exists = 'replace')
genre_lookup.to_sql('genres_lookup', engine, index=False, if_exists = 'replace')

26

In [25]:

# update table and set tconst as primary key
engine.execute('ALTER TABLE basics ADD PRIMARY KEY (`tconst`);')
engine.execute('ALTER TABLE ratings ADD PRIMARY KEY (`tconst`);')
engine.execute('ALTER TABLE early_2k_movies ADD PRIMARY KEY (`tconst`);')

# Testing Queries

In [26]:
# check if tables loaded
q = """SHOW TABLES;"""
pd.read_sql(q,engine)

  Tables_in_makin_better_movies.sql
0                            basics
1                   early_2k_movies
2                     genres_lookup
3                           ratings
4                      title_genres

In [29]:
# test query for basics
q = """SELECT * FROM basics LIMIT 5;"""
pd.read_sql(q,engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0079644,November 1828,2001.0,140
4,tt0088751,The Naked Monster,2005.0,100

In [30]:
# test query for ratings
q = """SELECT * FROM ratings LIMIT 5;"""
pd.read_sql(q,engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1913
1  tt0000002            5.8       258
2  tt0000003            6.5      1717
3  tt0000004            5.6       170
4  tt0000005            6.2      2533

In [31]:
# test query for early_2k_movies
q = """SELECT * FROM early_2k_movies LIMIT 5;"""
pd.read_sql(q,engine)

      tconst     revenue      budget certifcation
0  tt0035423  76019000.0  48000000.0        PG-13
1  tt0118589   5271670.0  22000000.0        PG-13
2  tt0118652         0.0   1000000.0            R
3  tt0118694  12855000.0    150000.0           PG
4  tt0118852         0.0         0.0            R

In [32]:
# test query for title_genres
q = """SELECT * FROM title_genres LIMIT 5;"""
pd.read_sql(q,engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [33]:
# test query for genres_lookup
q = """SELECT * FROM genres_lookup LIMIT 5;"""
pd.read_sql(q,engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

# Ready for Part 4